# Tests historisation

In [17]:
import os
import pandas as pd
import geopandas as gpd
from sqlalchemy import create_engine, types
from create_query import to_indicator

engine = create_engine(os.getenv("DATABASE_URL"))

## Tests Solution 1

In [2]:
# fonction qui retourne l'indicateur sous différents formats (par défaut un DataFrame) à partir de la requête définie
to_indicator(engine, 't1-02-75')

   nb_pdc       p_range code
0      73  [15.0, 26.0)   75
1      13    [26, 65.0)   75
2       9     [0, 15.0)   75
3       4   [65, 175.0)   75
4       3  [175, 360.0)   75

In [3]:
# ajout d'indicateurs dans la table 'quotidien'
# on simule l'envoi quotidien des indicateurs (en répétant le même indicateur)
to_indicator(engine, 'i1',          histo=True, format='table', table_name='quotidien', table_option='replace')
to_indicator(engine, 'i1-01-93-02', histo=True, format='table', table_name='quotidien', table_option='append')
to_indicator(engine, 't1-02-75',    histo=True, format='table', table_name='quotidien', table_option='append')
to_indicator(engine, 't3-04-13001', histo=True, format='table', table_name='quotidien', table_option='append')
to_indicator(engine, 'i1',          histo=True, format='table', table_name='quotidien', table_option='append')
to_indicator(engine, 't1-02-75',    histo=True, format='table', table_name='quotidien', table_option='append')
to_indicator(engine, 't3-04-13001', histo=True, format='table', table_name='quotidien', table_option='append')
to_indicator(engine, 't1-02-75',    histo=True, format='table', table_name='quotidien', table_option='append')

   count
0     34

In [4]:
# tous les indicateurs ont le même format
with engine.connect() as conn:
    quotidien = pd.read_sql_table('quotidien', conn)
quotidien

,nombre,somme,crit_v,query,level,val,area,timest
0,0,0,null,null,null,null,null,2024-09-09 23:26:04.565941
1,1,23522,,i1,00,00,00,2024-09-09 23:26:04.550728
2,1,473,13,i1,01,93,02,2024-09-09 23:26:04.694977
3,1,450,06,i1,01,93,02,2024-09-09 23:26:04.694977
4,1,175,83,i1,01,93,02,2024-09-09 23:26:04.694977
5,1,170,84,i1,01,93,02,2024-09-09 23:26:04.694977
6,1,105,04,i1,01,93,02,2024-09-09 23:26:04.694977
7,1,57,05,i1,01,93,02,2024-09-09 23:26:04.694977
8,1,73,"[15.0,26.0)",t1,02,75,00,2024-09-09 23:26:04.753705
9,1,13,"[26,65.0)",t1,02,75,00,2024-09-09 23:26:04.753705
10,1,9,"[0,15.0)",t1,02,75,00,2024-09-09 23:26:04.753705
11,1,4,"[65,175.0)",t1,02,75,00,2024-09-09 23:26:04.753705
12,1,3,"[175,360.0)",t1,02,75,00,2024-09-09 23:26:04.753705
13,1,19,1,t3,04,13001,00,2024-09-09 23:26:04.809360
14,1,1,3,t3,04,13001,00,2024-09-09 23:26:04.809360
15,1,1,5,t3,04,13001,00,2024-09-09 23:26:04.809360
16,1,1,13,t3,04,13001,00,2024-09-09 23:26:04.809360
17,1,1,16,t3,04,13001,00,2024-09-09 23:26:04.809360
18,1,23522,,i1,00,00,00,2024-09-09 23:26:04.864505
19,1,73,"[15.0,26.0)",t1,02,75,00,2024-09-09 23:26:04.883863
20,1,13,"[26,65.0)",t1,02,75,00,2024-09-09 23:26:04.883863
21,1,9,"[0,15.0)",t1,02,75,00,2024-09-09 23:26:04.883863
22,1,4,"[65,175.0)",t1,02,75,00,2024-09-09 23:26:04.883863
23,1,3,"[175,360.0)",t1,02,75,00,2024-09-09 23:26:04.883863
24,1,19,1,t3,04,13001,00,2024-09-09 23:26:04.932665
25,1,1,3,t3,04,13001,00,2024-09-09 23:26:04.932665
26,1,1,5,t3,04,13001,00,2024-09-09 23:26:04.932665
27,1,1,13,t3,04,13001,00,2024-09-09 23:26:04.932665
28,1,1,16,t3,04,13001,00,2024-09-09 23:26:04.932665
29,1,73,"[15.0,26.0)",t1,02,75,00,2024-09-09 23:26:04.973319
30,1,13,"[26,65.0)",t1,02,75,00,2024-09-09 23:26:04.973319
31,1,9,"[0,15.0)",t1,02,75,00,2024-09-09 23:26:04.973319
32,1,4,"[65,175.0)",t1,02,75,00,2024-09-09 23:26:04.973319
33,1,3,"[175,360.0)",t1,02,75,00,2024-09-09 23:26:04.973319

In [5]:
# passage de la table 'quotidien' à la table 'mensuel' (chaque mois on retrouve un seul enregistrement de chaque indicateur)
# le traitement pourrait se faire directement en SQL sans passer par un DataFrame
# la requête est la même pour passer de jour à mois que pour passer de mois à année

query = """
SELECT
  SUM(nombre) AS nombre,  SUM(somme) AS somme,  crit_v,  query,  level,  val,  area
FROM
  quotidien
WHERE
  (timest >= CAST(NOW() AS date))   AND   (timest < CAST((NOW() + INTERVAL '1 month') AS date))
GROUP BY
  crit_v,  query,  level,  val,  area
ORDER BY
  query,  level,  val,  area
"""

with engine.connect() as conn:
    mensuel = pd.read_sql_query(query, conn)

mensuel.to_sql('mensuel', engine, if_exists='replace', index=False)

mensuel

    nombre    somme       crit_v query level    val  area
0      2.0  47044.0                 i1    00     00    00
1      1.0    105.0           04    i1    01     93    02
2      1.0     57.0           05    i1    01     93    02
3      1.0    450.0           06    i1    01     93    02
4      1.0    473.0           13    i1    01     93    02
5      1.0    175.0           83    i1    01     93    02
6      1.0    170.0           84    i1    01     93    02
7      0.0      0.0         null  null  null   null  null
8      3.0     27.0     [0,15.0)    t1    02     75    00
9      3.0    219.0  [15.0,26.0)    t1    02     75    00
10     3.0      9.0  [175,360.0)    t1    02     75    00
11     3.0     39.0    [26,65.0)    t1    02     75    00
12     3.0     12.0   [65,175.0)    t1    02     75    00
13     2.0     38.0            1    t3    04  13001    00
14     2.0      2.0           13    t3    04  13001    00
15     2.0      2.0           16    t3    04  13001    00
16     2.0      2.0            3    t3    04  13001    00
17     2.0      2.0            5    t3    04  13001    00

In [6]:
# indicateur 't1-m-02-75' sur le mois
# la requête est générique (en séparant les cas ou c'est la moyenne de ceux ou c'est la somme)

query = """
SELECT
  somme / nombre AS nb_pdc,  crit_v AS p_range
FROM
  mensuel
WHERE
  query = 't1' AND level = '02' AND val = '75'
"""
with engine.connect() as conn:
    t1_m_02_75 = pd.read_sql_query(query, conn)

# on retrouve l'indicateur du jour
t1_m_02_75

   nb_pdc      p_range
0     9.0     [0,15.0)
1    73.0  [15.0,26.0)
2     3.0  [175,360.0)
3    13.0    [26,65.0)
4     4.0   [65,175.0)

## Tests solution 2

In [12]:
import json

In [7]:
val_t8_01_93_02 = [
    {
        "department": "01",
        "operators": [
            {
                "name": "Bouygues",
                "sum": 42,
                "delta": 3
            },
            {
                "name": "Electra",
                "sum": 12,
                "delta": -2
            },
            {
                "name": "Engie",
                "sum": 252,
                "delta": 154
            }
        ]
    },
    {
        "department": "02",
        "operators": [
            {
                "name": "Bouygues",
                "sum": 4,
                "delta": 3
            },
            {
                "name": "Electra",
                "sum": 52,
                "delta": 23
            },
            {
                "name": "Engie",
                "sum": 1,
                "delta": 1
            }
        ]
    }
]

In [20]:
json.dumps(val_t8_01_93_02)

'[{"department": "01", "operators": [{"name": "Bouygues", "sum": 42, "delta": 3}, {"name": "Electra", "sum": 12, "delta": -2}, {"name": "Engie", "sum": 252, "delta": 154}]}, {"department": "02", "operators": [{"name": "Bouygues", "sum": 4, "delta": 3}, {"name": "Electra", "sum": 52, "delta": 23}, {"name": "Engie", "sum": 1, "delta": 1}]}]'

In [48]:
t8_01_93_02 = pd.DataFrame({'code': ['t8']*3, 'level': [1]*3, 'target': [93]*3, 'sub_level': [2]*3, 'value': [val_t8_01_93_02]*3, 
                            'timestamp': ['2024-09-09T15:05:28+00:00', '2024-09-10T15:05:28+00:00', '2024-09-11T15:05:28+00:00']})
t8_01_93_02

,code,level,target,sub_level,value,timestamp
0,t8,1,93,2,"[{'department': '01', 'operators': [{'name': '...",2024-09-09T15:05:28+00:00
1,t8,1,93,2,"[{'department': '01', 'operators': [{'name': '...",2024-09-10T15:05:28+00:00
2,t8,1,93,2,"[{'department': '01', 'operators': [{'name': '...",2024-09-11T15:05:28+00:00

In [49]:
dtype={'code': types.TEXT, 'level': types.SMALLINT, 'target': types.TEXT, 'sub_level': types.SMALLINT, 'value': types.JSON, 'timestamp': types.TIMESTAMP}
t8_01_93_02.to_sql("mensuel_3", engine, if_exists="replace", dtype=dtype)

-1

In [50]:
query = """
with dpt_ext as
    (select 
        target, level, code, sub_level, jsonb_path_query(to_jsonb(value), '$.department') as department, jsonb_path_query(to_jsonb(value), ' $.operators') as oper_json, timestamp
    from 
        mensuel_3)
select 
    target, level, code, sub_level, department, jsonb_path_query(to_jsonb(oper_json), ' $.name') as operator, jsonb_path_query(to_jsonb(oper_json), ' $.sum') as sum, jsonb_path_query(to_jsonb(oper_json), ' $.delta') as delta, timestamp
from 
    dpt_ext
"""
with engine.connect() as conn:
    test_json = pd.read_sql_query(query, conn)
test_json

,target,level,code,sub_level,department,operator,sum,delta,timestamp
0,93,1,t8,2,01,Bouygues,42,3,2024-09-09 15:05:28
1,93,1,t8,2,01,Electra,12,-2,2024-09-09 15:05:28
2,93,1,t8,2,01,Engie,252,154,2024-09-09 15:05:28
3,93,1,t8,2,02,Bouygues,4,3,2024-09-09 15:05:28
4,93,1,t8,2,02,Electra,52,23,2024-09-09 15:05:28
5,93,1,t8,2,02,Engie,1,1,2024-09-09 15:05:28
6,93,1,t8,2,01,Bouygues,42,3,2024-09-10 15:05:28
7,93,1,t8,2,01,Electra,12,-2,2024-09-10 15:05:28
8,93,1,t8,2,01,Engie,252,154,2024-09-10 15:05:28
9,93,1,t8,2,02,Bouygues,4,3,2024-09-10 15:05:28
10,93,1,t8,2,02,Electra,52,23,2024-09-10 15:05:28
11,93,1,t8,2,02,Engie,1,1,2024-09-10 15:05:28
12,93,1,t8,2,01,Bouygues,42,3,2024-09-11 15:05:28
13,93,1,t8,2,01,Electra,12,-2,2024-09-11 15:05:28
14,93,1,t8,2,01,Engie,252,154,2024-09-11 15:05:28
15,93,1,t8,2,02,Bouygues,4,3,2024-09-11 15:05:28
16,93,1,t8,2,02,Electra,52,23,2024-09-11 15:05:28
17,93,1,t8,2,02,Engie,1,1,2024-09-11 15:05:28